# 1.จงเขียนตารางสูตรคูณให้ผลลัพท์ที่ออกมาเป็นแบบตัวอย่างด้านล่างโดยใช้คำสั่ง while
num1 = 2
while num1 <= 12:
    num2 = 1
    print("------------")
    print("  [ %d ] " % num1)

    while num2 <= 12:
        print(num1, "*", num2, "=", num1 * num2)
        num2 += 1
    num1 += 1


# 2.จงเขียนตารางสูตรคูณให้ผลลัพท์ที่ออกมาเป็นแบบตัวอย่างด้านล่างโดยใช้คำสั่ง for
for n in range(2, 13):
    print("------------")
    print("  [ %d ] " % n)
    for i in range(1, 12 + 1):
        print("%d * %d : %d" % (n, i, n * i))
